set_property IOSTANDARD LVCMOS33 [get_ports {enet_rxd[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {enet_rxd[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {enet_rxd[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {enet_rxd[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports ENET0_GMII_RX_DV_0]
set_property IOSTANDARD LVCMOS33 [get_ports MDIO_ETHERNET_0_0_mdio_io]
set_property IOSTANDARD LVCMOS33 [get_ports MDIO_ETHERNET_0_0_mdc]
set_property IOSTANDARD LVCMOS33 [get_ports ENET0_GMII_RX_CLK_0]
set_property IOSTANDARD LVCMOS33 [get_ports ENET0_GMII_TX_CLK_0]
set_property IOSTANDARD LVCMOS33 [get_ports {enet_txd[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {enet_txd[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {enet_txd[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {enet_txd[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ENET0_GMII_TX_EN_0[0]}]
#set_property IOSTANDARD LVCMOS33 [get_ports riscv_sysled]
#set_property IOSTANDARD LVCMOS33 [get_ports riscv_uart_debug_pin]
set_property IOSTANDARD LVCMOS33 [get_ports riscv_uart_rx_pin]
set_property IOSTANDARD LVCMOS33 [get_ports riscv_jtag_TCK]
set_property IOSTANDARD LVCMOS33 [get_ports riscv_jtag_TMS]
set_property IOSTANDARD LVCMOS33 [get_ports riscv_jtag_TDI]
set_property IOSTANDARD LVCMOS33 [get_ports riscv_halted_ind]
set_property IOSTANDARD LVCMOS33 [get_ports riscv_uart_tx_pin]
set_property IOSTANDARD LVCMOS33 [get_ports {riscv_gpio[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {riscv_gpio[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports riscv_jtag_TDO]

set_property PACKAGE_PIN Y16 [get_ports {enet_rxd[0]}]
set_property PACKAGE_PIN V16 [get_ports {enet_rxd[1]}]
set_property PACKAGE_PIN V17 [get_ports {enet_rxd[2]}]
set_property PACKAGE_PIN Y17 [get_ports {enet_rxd[3]}]
set_property PACKAGE_PIN W18 [get_ports {enet_txd[0]}]
set_property PACKAGE_PIN Y18 [get_ports {enet_txd[1]}]
set_property PACKAGE_PIN V18 [get_ports {enet_txd[2]}]
set_property PACKAGE_PIN Y19 [get_ports {enet_txd[3]}]
set_property PACKAGE_PIN W16 [get_ports ENET0_GMII_RX_DV_0]
set_property PACKAGE_PIN W15 [get_ports MDIO_ETHERNET_0_0_mdc]
set_property PACKAGE_PIN Y14 [get_ports MDIO_ETHERNET_0_0_mdio_io]
set_property PACKAGE_PIN U14 [get_ports ENET0_GMII_RX_CLK_0]
set_property PACKAGE_PIN U15 [get_ports ENET0_GMII_TX_CLK_0]
set_property PACKAGE_PIN W19 [get_ports {ENET0_GMII_TX_EN_0[0]}]
#set_property PACKAGE_PIN W13 [get_ports riscv_sysled]
set_property PACKAGE_PIN W14 [get_ports riscv_halted_ind]
set_property PACKAGE_PIN M19 [get_ports riscv_jtag_TCK]
set_property PACKAGE_PIN P18 [get_ports riscv_jtag_TDI]
set_property PACKAGE_PIN M17 [get_ports riscv_jtag_TDO]
set_property PACKAGE_PIN N20 [get_ports riscv_jtag_TMS]
set_property PACKAGE_PIN B19 [get_ports riscv_uart_rx_pin]
set_property PACKAGE_PIN B20 [get_ports riscv_uart_tx_pin]
set_property PACKAGE_PIN H16 [get_ports {riscv_gpio[1]}]
set_property PACKAGE_PIN A20 [get_ports {riscv_gpio[0]}]


create_clock -period 40.000 -name ENET0_GMII_RX_CLK_0 -waveform {0.000 20.000} [get_ports ENET0_GMII_RX_CLK_0]
create_clock -period 40.000 -name ENET0_GMII_TX_CLK_0 -waveform {0.000 20.000} [get_ports ENET0_GMII_TX_CLK_0]
create_clock -period 200.000 -name riscv_jtag_TCK -waveform {0.000 100.000} [get_ports riscv_jtag_TCK]
set_property CLOCK_DEDICATED_ROUTE FALSE [get_nets riscv_jtag_TCK_IBUF]
#set_input_delay -clock [get_clocks ENET0_GMII_RX_CLK_0] -min -add_delay 2.000 [get_ports {enet_rxd[*]}]
#set_input_delay -clock [get_clocks ENET0_GMII_RX_CLK_0] -max -add_delay 4.000 [get_ports {enet_rxd[*]}]
#set_input_delay -clock [get_clocks ENET0_GMII_RX_CLK_0] -min -add_delay 2.000 [get_ports ENET0_GMII_RX_DV_0]
#set_input_delay -clock [get_clocks ENET0_GMII_RX_CLK_0] -max -add_delay 4.000 [get_ports ENET0_GMII_RX_DV_0]
#set_input_delay -clock [get_clocks riscv_jtag_TCK] -min -add_delay 2.000 [get_ports riscv_jtag_TDI]
#set_input_delay -clock [get_clocks riscv_jtag_TCK] -max -add_delay 4.000 [get_ports riscv_jtag_TDI]
#set_input_delay -clock [get_clocks riscv_jtag_TCK] -min -add_delay 2.000 [get_ports riscv_jtag_TMS]
#set_input_delay -clock [get_clocks riscv_jtag_TCK] -max -add_delay 4.000 [get_ports riscv_jtag_TMS]
#set_input_delay -clock [get_clocks clk_fpga_0] -min -add_delay 2.000 [get_ports riscv_uart_debug_pin]
#set_input_delay -clock [get_clocks clk_fpga_0] -max -add_delay 4.000 [get_ports riscv_uart_debug_pin]
#set_input_delay -clock [get_clocks clk_fpga_0] -min -add_delay 2.000 [get_ports riscv_uart_rx_pin]
#set_input_delay -clock [get_clocks clk_fpga_0] -max -add_delay 4.000 [get_ports riscv_uart_rx_pin]
#set_output_delay -clock [get_clocks ENET0_GMII_TX_CLK_0] -min -add_delay -1.000 [get_ports {enet_txd[*]}]
#set_output_delay -clock [get_clocks ENET0_GMII_TX_CLK_0] -max -add_delay 4.000 [get_ports {enet_txd[*]}]
#set_output_delay -clock [get_clocks clk_fpga_0] -min -add_delay -1.000 [get_ports {riscv_gpio[*]}]
#set_output_delay -clock [get_clocks clk_fpga_0] -max -add_delay 4.000 [get_ports {riscv_gpio[*]}]
#set_output_delay -clock [get_clocks ENET0_GMII_TX_CLK_0] -min -add_delay -1.000 [get_ports {ENET0_GMII_TX_EN_0[0]}]
#set_output_delay -clock [get_clocks ENET0_GMII_TX_CLK_0] -max -add_delay 4.000 [get_ports {ENET0_GMII_TX_EN_0[0]}]
#set_output_delay -clock [get_clocks clk_fpga_0] -min -add_delay -1.000 [get_ports riscv_halted_ind]
#set_output_delay -clock [get_clocks clk_fpga_0] -max -add_delay 4.000 [get_ports riscv_halted_ind]
#set_output_delay -clock [get_clocks riscv_jtag_TCK] -clock_fall -min -add_delay -1.000 [get_ports riscv_jtag_TDO]
#set_output_delay -clock [get_clocks riscv_jtag_TCK] -clock_fall -max -add_delay 4.000 [get_ports riscv_jtag_TDO]
#set_output_delay -clock [get_clocks clk_fpga_0] -min -add_delay -1.000 [get_ports riscv_sysled]
#set_output_delay -clock [get_clocks clk_fpga_0] -max -add_delay 4.000 [get_ports riscv_sysled]
#set_output_delay -clock [get_clocks clk_fpga_0] -min -add_delay -1.000 [get_ports riscv_uart_tx_pin]
#set_output_delay -clock [get_clocks clk_fpga_0] -max -add_delay 4.000 [get_ports riscv_uart_tx_pin]
#set_false_path -from [get_clocks riscv_jtag_TCK] -to [get_clocks clk_fpga_0]
